{
    "why-am-i-still-running": {
        "title": "Why Am I Still Running?",
        "body": [
            "This is a question that every runner should ask themselves every once in a while. It’s unwise to ask it too often or else you’re just constantly questioning yourself. But if you haven’t examined yourself recently, this can be an important way to evaluate your priorities. I have two basic reasons why I have decided to pursue running at the next level: I still love to compete, and I still think I have room to grow as an athlete. As soon as I lose one of those two things, I think it’s time for my career to be over.",
            "Let’s take a look at those two things and why they have convinced me to give up the money, career growth, and lifestyle that would come with hanging up my spikes. I still love to compete. There are very few things that are more exhilarating and elating than winning a race. Granted, at this level, wins are hard to come by, but that makes them so much sweeter. And winning doesn’t just have to be breaking the tape. Placing high at a championship meet or slicing a precious second off your personal best are wins as well. The fulfilment that comes with these wins has me addicted to my sport. However, the love of competing is not sufficient by itself to keep me dedicated to the day by day training, the restriction of beers, the lack of a big paycheck.",
            "The other part of the equation is my belief that I can still be better. In high school, I worked hard and saw a lot of success. I won two state titles and posted times that allowed me to be competitive on a national level. In college, those precious seconds that I was chopping off just about every time I touched a track in high school were becoming much harder to negotiate with. By a lot of measures, I had a successful college career. I dropped time in every event, I was consistently scoring points at the ACC championships (which is maybe the deepest conference in the country for middle distance events… but that’s another post in itself), and I was a part of two All-American DMRs. Still though, I can’t help but be disappointed in some regards. I never made an NCAA championships as an individual, I never broke 4 minutes, I never won an individual conference title. There were a lot of goals I had set for myself that I was unable to accomplish.", 
            "So, there you have it. A love for this sport, combined with an unshakeable feeling of unfinished business leaves me with no choice but to keep grinding, keep running, and keep striving to get as much out of my body as I can."
        ],
        "photo-path": "../../assets/media/dirt-road-2-thumbnail.JPG"
    },
    "life-off-the-track": {
        "title": "Life Off the Track",
        "body": [
            "As an elite runner, it’s really easy to fall into a routine of run, eat, sleep repeat twice a day every day. And sometimes that’s exactly what we need. In distance running, repetition and consistency are everything. You have to be disciplined to even have a shot at being successful. But in this monotonous, consuming, non-lucrative sport, it’s crucial to have other pursuits. I could write an entire post about the reasons I think this is important, but for now, I’ll stick to talking about the things that I do to take up the non-running hours of my day.",
            "In the off-season, I like to drink beer. I like watching sports. I play video games from time to time. I love doing water sports at my friend Nick’s lake house on beloved Lake Wawasee, and I love going on road trips with my girlfriend Kelly and our friends when the I have the opportunity. A lot of those things, however, have to take a serious backseat to training for about 10 months of the year. They’re also just hobbies, not things that I feel really passionate about, not things that help to give me purpose outside of running. I need something that I can get invested in, so that when I’m running like trash or I’m headed into my fifth week of no running after an injury my whole life doesn’t feel like it’s crumbling. I also need a source of income, because while DTC is covering a lot of living expenses, life requires a bit more cash than I’m currently worth on the track. So to satisfy these two needs in my life, I’ve decided to turn to computer programming, or web development more specifically.",
            "Both my undergrad and graduate degrees from Notre Dame are in computer science, and I knew programming was my professional fit almost immediately upon discovering it. As an undergrad I declared engineering as my intended major, because I was good at math in high school, and that’s what kids that are good at math are supposed to do. In our Intro to Engineering course, we did a little bit of programming in Matlab (which I now know is a terrible language in which I hope to never program again, but I digress) and I really liked it. So sophomore year I declared CS and started taking classes specific to that course of study that semester I went from getting a lot of Bs (and a couple Cs) to my first (and only) 4.0 of college. These classes were supposed to be harder, but I just loved them and I was doing so much better in them than in any other classes I had taken. It had to be the right fit.",
            "From there, I took a bunch more CS classes and got a few internships doing various tech/programming things and started to hone in on what sector of this broad field I wanted to go into. I took a class on artificial intelligence, a couple on databases, a networks class where I built a battleship game that could be played between players on two separate computers. In my second internship (first one in actual software development) at Epic, I was tasked with building a web application that displayed data to users in a readable, visually appealing way. This was when I was really got familiar with JavaScript and CSS and how to make things pop on a webpage. It was definitely the most fun I had had up to that point doing software development. Since then I’ve done another internship that included a lot of that same stuff, and taken an advanced databases course in which I was in charge of the front-end (visual aspects) of a music sharing application that my group was building.",
            "I really think that I’ve found my niche, and I’m really excited to continue to develop my skills as a coder and as a designer. This site is just the start of my post-college web development career, and I’ll plan to post more about future projects on this site when it’s feasible."
        ],
        "photo-path": "../../assets/media/wake-surfing-thumbnail.JPG"
    }

}